# Missig Datas

In [16]:
import pandas as pd
import numpy as np

### Finding Missing Datas

            isna()

It works on columns

In [17]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [1, 2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, np.nan],
    'D': [1, np.nan, np.nan, np.nan, 5]
}
df = pd.DataFrame(data)
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [18]:
df.isna()

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

##### total number of NaN/missing data in columns

In [19]:
df.isna().sum()

A    1
B    0
C    2
D    3
dtype: int64

check if columns have NaN/missing data

In [20]:
df.isna().any()

A     True
B    False
C     True
D     True
dtype: bool

### Removing Missing Data

        df.dropna(thresh = number_of_missing_data_in_Row)

It works on rows

In [21]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [22]:
df.dropna()
#drop every row with NaN/missing data

     A  B    C    D
0  1.0  1  1.0  1.0

##### drop rows of atleast specified number of Null values

In [23]:
df.dropna(thresh = 3)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

### Filling the missing data

        df.fillna()

It works on column

In [24]:
# Fill every missing data cell with 0
df.fillna(0)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [26]:
# Fill specific missing data cell with specified data
specifiedValues = {
    "A": 0,
    "B": 100,
    "C": 300,
    "D": 400
}
df.fillna(value = specifiedValues)

     A  B      C      D
0  1.0  1    1.0    1.0
1  2.0  2    2.0  400.0
2  0.0  3    3.0  400.0
3  4.0  4  300.0  400.0
4  5.0  5  300.0    5.0

In [27]:
# Fill specific missing data cell with mean, median etc
df.fillna(df.mean())

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  3.0
2  3.0  3  3.0  3.0
3  4.0  4  2.0  3.0
4  5.0  5  2.0  5.0